rainer20512/stm32-fw/common/src/dev/uart_dev.c
  if ( uhandle->OnError ) {
    uhandle->last_errors |= HAL_UART_ERROR_DMA;
    uhandle->OnError(uhandle);
  }
}

static void UsartDmaChannelInit(UsartHandleT *uhandle, const HW_DmaType *dma, UsartDmaDirectionEnumType dmadir )
{
  DMA_HandleTypeDef *hdma = dma->dmaHandle;
  
  HW_DMA_HandleInit(hdma, dma, uhandle );

  switch ( dmadir ) 
  {
    case USART_DMA_RX:
      hdma->Init.Direction = DMA_PERIPH_TO_MEMORY;
      uhandle->hRxDma = dma->dmaHandle;
      break;
    case USART_DMA_TX:
      hdma->Init.Direction = DMA_MEMORY_TO_PERIPH;
      uhandle->hTxDma = dma->dmaHandle;
      break;
    default:
        Error_Handler_XX(-17, __FILE__, __LINE__);
        return;
  }
  
  HAL_DMA_Init(hdma);

  /* 
   * All callbacks have been set to NULL by Init, 
   * now set Callbacks for DMA complete and DMA error 
   */

  switch ( dmadir ) 
  {
    case USART_DMA_RX:
      hdma->XferCpltCallback = UART_DMAReceiveCplt;
      hdma->XferErrorCallback = UART_DMAError;
      break;
    case USART_DMA_TX:
      hdma->XferCpltCallback = UART_DMATransmitCplt;   
      hdma->XferErrorCallback = UART_DMAError;
      break;
  }

  return;
}

bool COM_Init(const HW_DeviceType *self)
{
    USART_AdditionalDataType *adt   = USART_GetAdditionalData(self);
    UsartHandleT *myHandle          = adt->myHandle;

    /* Set and enable clock */
    Usart_Clock_Init(self, true);
    
    /* Init GPIO Pins, GPIO Clocks and UART Clock */
    Usart_GPIO_Init(self);

    /* Clear handle */
    memset(myHandle, 0, sizeof(UsartHandleT) );


    /* Assign U(S)ART Instance to handle */
    myHandle->Instance = (USART_TypeDef*)self->devBase; 

    /* Set RX to character mode by default */
    myHandle->bRxCharMode = true;

    /* Set Communication Parameters (baudrate) */
    if ( !Usart_SetCommParams(self, adt->myBaudrate, true) ) return false;

    /* Configure the NVIC, enable interrupts */
    HW_SetAllIRQs(self->devIrqList, true);

    /* Enable DMA, if specified */            
    if ( self->devDmaRx || self->devDmaTx ) {

        HW_SetDmaChClock(self->devDmaTx, self->devDmaRx);
        // Take the first interrupt to copy prio and subprio to dma channel interrupts
        const HW_IrqType *irq = self->devIrqList->irq;

        if ( self->devDmaRx ) {
            UsartDmaChannelInit( myHandle, self->devDmaRx, USART_DMA_RX );
            HAL_NVIC_SetPriority(self->devDmaRx->dmaIrqNum, irq->irq_prio, irq->irq_subprio);
            HAL_NVIC_EnableIRQ(self->devDmaRx->dmaIrqNum);
        }
        if ( self->devDmaTx ) {
            UsartDmaChannelInit( myHandle, self->devDmaTx, USART_DMA_TX );
            HAL_NVIC_SetPriority(self->devDmaTx->dmaIrqNum, irq->irq_prio, irq->irq_subprio);
            HAL_NVIC_EnableIRQ(self->devDmaTx->dmaIrqNum);
        }
    } // if DMA
    return true;
}

void COM_DeInit(const HW_DeviceType *self)
{
    HW_Reset( (USART_TypeDef*)self->devBase );

    /* Disable GPIO Pins */
    GpioAFDeInitAll(self->devGpioAF);
    
    /* disable interrupts */
    HW_SetAllIRQs(self->devIrqList, false);

    /* Disable the DMA, if used */
    if(self->devDmaTx) {
      /* De-Initialize the Tx part  */
      HAL_DMA_DeInit(self->devDmaTx->dmaHandle);
      HAL_NVIC_DisableIRQ(self->devDmaTx->dmaIrqNum);
    }
    if(self->devDmaRx) {
      /* De-Initialize the Rx part  */
      HAL_DMA_DeInit(self->devDmaRx->dmaHandle);
      HAL_NVIC_DisableIRQ(self->devDmaRx->dmaIrqNum);
    }

    /* Disable clock */
    Usart_Clock_Init(self, false);
}


/******************************************************************************
 * Check, whether the system may enter Stop 2 mode. 
 * This is the case, if neither transmit is active
 * nor receive in character mode or receiver enabled in block mode
 *****************************************************************************/
bool COM_AllowStop(const HW_DeviceType *self)
{
    UsartHandleT *myHandle  = USART_GetAdditionalData(self)->myHandle;
    USART_TypeDef *u        = (USART_TypeDef*)self->devBase;

    return (u->ISR & USART_ISR_TC ) &&  ( u->CR1 & ( USART_CR1_TXEIE | USART_CR1_TCIE ) )  == 0  && (myHandle->bRxCharMode ? u->ISR & USART_ISR_BUSY : u->CR1 & USART_CR1_RE ) == 0;
}

#if defined(USART1) && defined(USE_USART1)
    UsartHandleT HandleCOM1;

    static const HW_GpioList_AF gpio_com1 = {
        .num = 2,
        .gpio = {COM1_TX, COM1_RX} ,
    };

    static const USART_AdditionalDataType additional_com1 = {
        &HandleCOM1,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };
    
    #if defined(COM1_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com1_tx;
        static const HW_DmaType dmatx_com1 = { &hdma_com1_tx, COM1_TX_DMA };
    #endif
    #if defined(COM1_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com1_rx;
        static const HW_DmaType dmarx_com1 = { &hdma_com1_rx, COM1_RX_DMA };
    #endif

    static const HW_IrqList irq_com1 = {
        .num = 1,
        .irq = { COM1_IRQ, },
    };

    const HW_DeviceType HW_COM1 = {
        .devName        = "COM1",
        .devBase        = USART1,
        .devGpioAF        = &gpio_com1,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com1,
        .devIrqList     = &irq_com1,
        #if defined(COM1_USE_TX_DMA)
            .devDmaTx = &dmatx_com1,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM1_USE_RX_DMA)
            .devDmaRx = &dmarx_com1,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

#if defined(USART2) && defined(USE_USART2)
    UsartHandleT HandleCOM2;

    static const HW_GpioList_AF gpio_com2 = {
        .num = 2,
        .gpio = {COM2_TX, COM2_RX} ,
    };

    static const USART_AdditionalDataType additional_com2 = {
        &HandleCOM2,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };

