rainer20512/stm32-fw/common/src/dev/uart_dev.c
/******************************************************************************
 * Transmit and receive one Byte with active wait/timeout
 * txrx - byte to send / received byte on return
 * tmo  - timeout ( in ms )
 * will return false, if timout occured before reception
 * note: This function reset all interrupt sources 
 *****************************************************************************/
bool UsartTxRxOneByteWait(UsartHandleT *uhandle, uint8_t *txrx, uint32_t tmo) 
{
  uint32_t ticktmo = HAL_GetTick() + tmo;
  USART_TypeDef *u = uhandle->Instance;
  
  assert(u->CR1 & USART_CR1_UE);
  /* Disable all interrupts */
  CLEAR_BIT(u->CR1, USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_RXNEIE | USART_CR1_PEIE);
  CLEAR_BIT(u->CR3, USART_CR3_EIE );
  
 
  /* Enable Tx/Rx */
  SET_BIT(u->CR1, USART_CR1_TE | USART_CR1_RE );

  /* Wait for TX empty */
  while ( !READ_BIT(u->ISR, USART_ISR_TXE ) && HAL_GetTick() != ticktmo ) ;
  if ( HAL_GetTick() == ticktmo ) return false;

  /* dummy read to empty receive register */
  (void)u->RDR;   
  u->TDR = *txrx;

  /* Wait for RX not empty or timeout */
  while ( !READ_BIT(u->ISR, USART_ISR_RXNE) && HAL_GetTick() != ticktmo ) ;
  if ( HAL_GetTick() == ticktmo ) {
    DEBUG_PUTS("Unexpected timeout on Tx/Rx byte");
    return false;
  }

  *txrx = u->RDR;

  /* If usart is in blockmode, disable receiver */
  if ( !uhandle->bRxCharMode )  
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );    

  return true;
}

void UsartStartTx(UsartHandleT *uhandle, uint8_t *data, uint32_t txSize)
{  
  uhandle->TxSize  = txSize; 
  
  /* If we have an DMA-handle, activate DMA transfer */
  if ( uhandle->hTxDma) {
    /* Enable the UART transmit DMA channel */
    HAL_DMA_Start_IT(uhandle->hTxDma, (uint32_t)data, (uint32_t)&uhandle->Instance->TDR, txSize);
    
    /* Clear the TC flag in the ICR register */
    uhandle->Instance->ICR = UART_CLEAR_TCF;
    
    /* Assume a successful transmission: all elements transferred, used on completion */
    uhandle->TxCount = uhandle->TxSize;
    /* 
     * Enable the DMA transfer for transmit request by setting the DMAT bit
     * in the UART CR3 register 
     */
    
    SET_BIT(uhandle->Instance->CR3, USART_CR3_DMAT);
  } else {
    
    /* Characters transferred will be counted up in txe interrupt, so initialize to 0 here */
    uhandle->TxCount = 0; 
    /* USART Interrupt driven transfer */
    SET_BIT(uhandle->Instance->CR1, USART_CR1_TXEIE);
  }
}

void UsartStopTx(UsartHandleT *uhandle)
{
  CLEAR_BIT(uhandle->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));
}

void UsartStartRx(UsartHandleT *uhandle, uint8_t *rxbuf, uint16_t rxsize)
{
    uhandle->blockIn     = rxbuf;
    uhandle->RxSize      = rxsize;
    uhandle->bRxCharMode = false;
    uhandle->RxCount     = 0;

    /* Clear the RXNE flag in the ISR register and enable U(S)ART */
    uhandle->Instance->RQR = USART_RQR_RXFRQ;
    Usart_EnableRx(uhandle->Instance, false);
    
    if ( uhandle->hRxDma ) {

        /* Enable the UART receive DMA channel */
        HAL_DMA_Start_IT(uhandle->hRxDma, (uint32_t)&uhandle->Instance->RDR, (uint32_t)rxbuf, rxsize);
    
    
        /* Assume a successful transmission: all elements transferred, used on completion */
        uhandle->TxCount = uhandle->RxSize;
        /* 
         * Enable the DMA transfer for transmit request by setting the DMAR bit
         * in the UART CR3 register 
         */
    
        SET_BIT(uhandle->Instance->CR3, USART_CR3_DMAR);
    }
}

/******************************************************************************
 * Abort asynchronous operations
 *****************************************************************************/
void UsartAbortOp (UsartHandleT *uhandle)
{
  USART_TypeDef *i = uhandle->Instance;  
  DMA_HandleTypeDef *hdma;
  /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(i->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
  CLEAR_BIT(i->CR3, USART_CR3_EIE);


  /* Disable the UART DMA Tx request if enabled */
  if (HAL_IS_BIT_SET(i->CR3, USART_CR3_DMAT))
  {
    CLEAR_BIT(i->CR3, USART_CR3_DMAT);

    /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
    hdma = uhandle->hTxDma;
    if ( hdma != NULL)
    {
      /* Set the UART DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hdma->XferAbortCallback = NULL;

      HAL_DMA_Abort(hdma);
    }
  }

  /* Disable the UART DMA Rx request if enabled */
  if (HAL_IS_BIT_SET(i->CR3, USART_CR3_DMAR))
  {
    CLEAR_BIT(i->CR3, USART_CR3_DMAR);

    hdma = uhandle->hRxDma;
    /* Abort the UART DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (hdma != NULL)
    {
      /* Set the UART DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hdma->XferAbortCallback = NULL;

      HAL_DMA_Abort(hdma);
    }
  }

  /* If usart is in blockmode, disable receiver */
  if ( !uhandle->bRxCharMode ) CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );    

  /* Clear the Error flags in the ICR register */
  i->ICR = UART_CLEAR_OREF | UART_CLEAR_NEF | UART_CLEAR_PEF | UART_CLEAR_FEF;

}

void UsartStopRx(UsartHandleT *uhandle)
{
  CLEAR_BIT(uhandle->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
  CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_EIE);
  if ( !uhandle->bRxCharMode ) CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );
}


